[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:51:5
       Header: "OrgTranslation",
       accessor: "orgTranslation",
     },
-    {
-      Header: "Inactive",
-      accessor: "inactive",
-      Cell: ({ value }) => (value ? "True" : "False"),
-    },
+    {},
   ];
 
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!
