[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:19:39
     },
   });
 
-  const onSuccess = (organization) => {
-    toast(
-      `New organization Created - orgCode: ${organization.orgCode} orgTranslationShort: ${organization.orgTranslationShort}`,
-    );
-  };
+  const onSuccess = (organization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New organization Created - orgCode: BAL orgTranslationShort: Basketball Club"

Number of calls: 0
