[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:42:39
     },
   });
 
-  const onSuccess = (organization) => {
-    toast(`Organization Updated - orgCode: ${organization.orgCode}`);
-  };
+  const onSuccess = (organization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:43:11
   });
 
   const onSuccess = (organization) => {
-    toast(`Organization Updated - orgCode: ${organization.orgCode}`);
+    toast(``);
   };
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Organization Updated - orgCode: BAL"
Received: ""

Number of calls: 1
