[Killed] Regex
main/components/HelpRequest/HelpRequestForm.js:27:23
   const isodate_regex =
     /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
   // Stryker restore Regex
-  const email_regex = /\S@\S+\.\S/;
+  const email_regex = /\S@\S+\.\s/;
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
killedBy: HelpRequestForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:31:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">id</Form.Label>
-              <Form.Control
-                data-testid="HelpRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">id</Form.Label>
+              <Form.Control data-testid="HelpRequestForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col>
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:31:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">id</Form.Label>
-              <Form.Control
-                data-testid="HelpRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col>
killedBy: HelpRequestForm tests renders correctly when passing in a HelpRequest
statusReason: Error: Unable to find an element by: [data-testid="/HelpRequestForm-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:63:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requesterEmail && "Requester's Email is required."}
+              {true}
               {errors.requesterEmail?.type === "pattern" &&
                 "RequesterEmail must be a valid email address"}
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Requester's Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:63:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requesterEmail && "Requester's Email is required."}
+              {false}
               {errors.requesterEmail?.type === "pattern" &&
                 "RequesterEmail must be a valid email address"}
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Requester's Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:64:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "Requester's Email is required."}
-              {errors.requesterEmail?.type === "pattern" &&
-                "RequesterEmail must be a valid email address"}
+              {errors.requesterEmail?.type === "pattern" || "RequesterEmail must be a valid email address"}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests renders correctly when passing in a HelpRequest
statusReason: TestingLibraryElementError: Found multiple elements with the text: /id/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="id"

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:64:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "Requester's Email is required."}
-              {errors.requesterEmail?.type === "pattern" &&
-                "RequesterEmail must be a valid email address"}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /RequesterEmail must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:98:51
               id="tableOrBreakoutRoom"
               type="text"
               isInvalid={Boolean(errors.tableOrBreakoutRoom)}
-              {...register("tableOrBreakoutRoom", {
-                required: "Table or Breakout Room number is required.",
-              })}
+              {...register("tableOrBreakoutRoom", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table or Breakout Room number is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
