[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:63:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "RequesterEmail is required. "}
-              {errors.requesterEmail?.type === "pattern" &&
-                "RequesterEmail must be a valid email address."}
+              {errors.requesterEmail?.type === "pattern" || "RequesterEmail must be a valid email address."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests No Error messages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">RequesterEmail must be a valid email address.</div> instead

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:64:17
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "RequesterEmail is required. "}
               {errors.requesterEmail?.type === "pattern" &&
-                "RequesterEmail must be a valid email address."}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /RequesterEmail must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
