[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:56:27
               type="text"
               isInvalid={Boolean(errors.title)}
               {...register("title", {
-                required: "An article title is required.",
+                required: "",
                 maxlength: 255,
               })}
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /An article title is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:76:29
                 type="text"
                 isInvalid={Boolean(errors.url)}
                 {...register("url", {
-                  required: "A URL is required.",
+                  required: "",
                   maxlength: 255,
                 })}
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /A URL is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:116:39
                 id="email"
                 type="text"
                 isInvalid={Boolean(errors.email)}
-                {...register("email", {
-                  required: "An email is required.",
-                  maxlength: 255,
-                  pattern: {
-                    value: email_regex,
-                    message: "A valid email is required.",
-                  },
-                })}
+                {...register("email", {})}
               />
               <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /A valid email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:117:29
                 type="text"
                 isInvalid={Boolean(errors.email)}
                 {...register("email", {
-                  required: "An email is required.",
+                  required: "",
                   maxlength: 255,
                   pattern: {
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /An email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:119:28
                 {...register("email", {
                   required: "An email is required.",
                   maxlength: 255,
-                  pattern: {
-                    value: email_regex,
-                    message: "A valid email is required.",
-                  },
+                  pattern: {},
                 })}
               />
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /A valid email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.js:142:41
               id="dateAdded"
               type="datetime-local"
               isInvalid={Boolean(errors.dateAdded)}
-              {...register("dateAdded", {
-                required: "A valid date is required.",
-              })}
+              {...register("dateAdded", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /A valid date is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
