[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:58:53
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "ArticlesTable"),
+      ButtonColumn("Edit", "primary", editCallback, ""),
     );
     columns.push(
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:66:57
   }
 
   return (
-    <OurTable data={articles} columns={columns} testid={"ArticlesTable"} />
+    <OurTable data={articles} columns={columns} testid={""} />
   );
 }
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
