[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:63:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "RequesterEmail is required."}
-              {errors.requesterEmail?.type === "pattern" &&
-                "RequesterEmail must be a valid email address"}
+              {errors.requesterEmail?.type === "pattern" || "RequesterEmail must be a valid email address"}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests No Error messages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">RequesterEmail must be a valid email address</div> instead

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:63:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "RequesterEmail is required."}
-              {errors.requesterEmail?.type === "pattern" &&
-                "RequesterEmail must be a valid email address"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /RequesterEmail must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:64:17
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "RequesterEmail is required."}
               {errors.requesterEmail?.type === "pattern" &&
-                "RequesterEmail must be a valid email address"}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /RequesterEmail must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:77:46
               id="professorEmail"
               type="text"
               isInvalid={Boolean(errors.professorEmail)}
-              {...register("professorEmail", {
-                required: true,
-                pattern: email_regex,
-              })}
+              {...register("professorEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /ProfessorEmail must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:84:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.professorEmail && "ProfessorEmail is required."}
-              {errors.professorEmail?.type === "pattern" &&
+              {errors.professorEmail?.type !== "pattern" &&
                 "ProfessorEmail must be a valid email address"}
             </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /ProfessorEmail must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:84:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.professorEmail && "ProfessorEmail is required."}
-              {errors.professorEmail?.type === "pattern" &&
-                "ProfessorEmail must be a valid email address"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: Unable to find an element with the text: /ProfessorEmail must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:104:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateNeeded && "Date needed is required."}
+              {errors.dateNeeded || "Date needed is required."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.
